---
title: 意境 | 末日
description: 意境 | 末日
pubDate: 2019-02-02T13:45:25.000Z
category: Spark
---

现在车抛锚了, 我只能缩在吉普车里. 即便此刻是正午, 蔽天浓烟之下四周依然昏暗.



公路两边, 是无边无际的漫漫黄沙与鬼斧神工的岩石.

电力通讯网瘫痪, 手机成了废品, 我现在仍然把它放在口袋里也只是"出于情怀". 唯有自由的电波在空气中毫无痕迹的通过, 此刻这也是与外界通信的唯一方式.

转动车载电台上的旋钮时候, 除了通联, 偶尔还能收听到一些音乐电台. 这成了逃亡之路上唯一的消遣. 模糊记得, 昨天在加油站修整的时候似乎还能收到七八个台, 今天却只听到两个Classic和R&B. 从其它幸存者的闲聊那里听说, 位于感染区的音乐电台似乎都无人值守维护, 难保设备不出点什么小毛病, 因此戏称"废土电台". 而我只希望在到达尚未感染的北极圈之前(至少在目前来看还是伊甸园), 一路上还能有音乐陪伴.

调回到最先发现的音乐台, 方才从调谐钮上移开了手. 我放倒座椅躺下, 盯着触手可及的车顶, 盘算着下一步的行动. 车就是性命. 车(还能工作的车)才能载我到我想去或是我不得不去的地方.

但是, 就算我可以到达安全区, 在那里汇集的幸存者都会是些什么人呢? "像我这样的亡命之徒吧,"我自嘲道. 比起日益恶化生存条件, 人才是最大的威胁. 因此大多数时候我只是保持着沉默, 仅仅收听其他幸存者的通联而一言不发. 于我而言, 荒无人烟的沙漠才是最安全的地方: 视野开阔, 开车逃跑也容易. 一切都好, 除了食物弹药和汽油奇缺. 

我直起身, 从手套箱里摸出地图. 现在驶离Las Vegas已有30英里, 只要沿着15号公路一路向北, 汽油供应不会有问题. 我只能暗自祈祷先行的逃亡者还有点良心, 这样沿途的废弃加油站里很大概率可以找到汽油和一些工具. 桶装的油是首选, 拎上就可以往车里灌; 废弃的车里也可以偷出一些油, 不过一辆一地拿着虹吸管去挺麻烦, 况且汽油的味道实在不怎么样. 

想到这里, 我顺手拆了一包小甜饼. 几天之前与感染者一场血战之后, 我从超市里搜刮来的水和食物够支持我两个星期, 所以到达目的地前我每天都可以胡吃海喝, 前提是我吃不腻这种草莓果酱小曲奇.

只要我可以修好我的车.

不管怎么说, 在这里抛锚的我孤立无援. 没有人可以来帮助我. 走出这里只能依赖自己的勇气, 知识和希望. 一口白兰地下肚, 我把音量调小了些, 披上外套, 伸手去拉开车门.

